numbers = {
    0: "",
    1: "Один",
    2: "Два",
    3: "Три",
    4: "Четыре",
    5: "Пять",
    6: "Шесть",
    7: "Семь",
    8: "Восемь",
    9: "Девять",
    10: "Десять",
    11: "Одинадцать",
    12: "Двенадцать",
    13: "Тринадцать",
    14: "Четырнадцать",
    15: "Пятнадцать",
    16: "Шестнадцать",
    17: "Семнадцать",
    18: "Восемнадцать",
    19: "Девятнадцать",
    20: "Двадцать",
    30: "Тридцать",
    40: "Сорок",
    50: "Пятьдесят",
    60: "Шестьдесят",
    70: "Семьдесят",
    80: "Восемьдесят",
    90: "Девяносто",
    100: "Сто",
    200: "Двести",
    300: "Триста",
    400: "Четыреста",
    500: "Пятьсот",
    600: "Шестьсот",
    700: "Семьсот",
    800: "Восемьсот",
    900: "Девятьсот",
    1000: "Тысяча"
}
for n in range(21, 1001):
    if n in numbers: continue
    else:
        h = (n // 100) * 100
        dozen = ((n // 10) % 10) * 10
        digit = n % 10
        s = []
        if dozen == 10:
            s = [numbers[h].lower(), numbers[dozen + digit]]
        else:
            s = [numbers[h].lower(), numbers[dozen].lower(), numbers[digit].lower()]
        if "" in s: s.remove("")
        numbers[n] = " ".join(s).capitalize()

numbers[0] = "Ноль"

print(numbers[int(input())])

